use mybatis_test;
/*==============================================================*/
/* Table: goods_info                                            */
/*==============================================================*/
create table goods_info
(
   goods_no             varchar(20) not null,
   goods_name           varchar(50),
   goods_type           varchar(20),
   goods_price          varchar(15),
   vip_derate           varchar(15),
   goods_purchase_price varchar(15),
   max_num_single_purchase int,  -- 单次购买的最大数目
   goods_brand          varchar(20),
   goods_image_name     varchar(100),
   goods_weight         varchar(20),
   goods_origin         varchar(50),
   goods_special_info   varchar(50),
   goods_num            int,
   goods_month_sales    varchar(10),
   goods_purchase_date  date,
   store_name             varchar(50),
   primary key (goods_no)
);
drop table if exists goods_info;
drop table goods_info;
insert into goods_info  
values
('sh001','金玉兰白酒','酒','169.89','10.36','89.99',100,'金玉兰','homeGoods-1','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh002','吾爱手机','数码产品','1699.79','99.99','89.99',10,'吾爱','homeGoods-2','100g','北京市','便利生活，拍照必选','100','50','2023/5/16','store002'),
('sh003','金玉兰白酒','酒','169.89','20.00','89.99',56,'金玉兰','homeGoods-3','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh112','金玉兰红酒','酒','169.89','20.00','89.99',55,'金玉兰','homeGoods-4','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh113','雅诗兰黛洗面乳','酒','169.89','20.00','89.99',200,'金玉兰','homeGoods-5','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh132','红酒兰度干','酒','169.89','20.00','89.99',10,'金玉兰','homeGoods-2','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh986','金玉兰白酒','酒','169.89','20.00','89.99',15,'金玉兰','homeGoods-1','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh265','金玉兰白酒','酒','169.89','20.00','89.99',17,'金玉兰','homeGoods-1','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh369','金玉兰白酒','酒','169.89','20.00','89.99',200,'金玉兰','homeGoods-1','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh163','金玉兰白酒','酒','169.89','20.00','89.99',99,'金玉兰','homeGoods-1','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh5986','金玉兰白酒','酒','169.89','20.00','89.99',199,'金玉兰','homeGoods-1','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001'),
('sh3698','金玉兰白酒','酒','169.89','20.00','89.99',563,'金玉兰','homeGoods-1','500g','重庆市','待客送礼，不错选择','100','50','2023/5/16','store001')
;
select * from goods_info